# JOINS
---

A `join` clause in SQL is used to combine rows from two or more tables, based on a related column between them.

### Connecting with the database

In [ ]:
%load_ext sql
# replace with your own credentials
%sql ibm_db_sa://my-username:my-password@dashdb-txn-sbox-yp-dal09-03.services.dal.bluemix.net:50000/BLUDB

Tables on which all the join operations will be applied are as follows :

In [2]:
%sql select * from NEW_STUDENTS

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[('Mexico', 'Natasha', 'Martinax', 48),
 ('Mexico', 'Rachael', 'Grate', 45),
 ('Romania', 'Alexandra', 'Botez', 57),
 ('Romania', 'Alina', 'Smolyar', 52)]

In [3]:
%sql select * from SPORTS_STUDENTS

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[('Russia', 'Bail', 'Goodwin', 46),
 ('Sweden', 'Emlyn', 'Erricker', 55),
 ('Poland', 'Barny', 'Ingerson', 57),
 ('Romania', 'Alina', 'Smolyar', 52)]

### 1. INNER JOIN
Inner join creates a new result table by combining cloumn values of two tables (A and B) based upon the join-predicate. It is similar to cross join or cartesian product.

In [4]:
%sql select * from NEW_STUDENTS inner join SPORTS_STUDENTS on True

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[('Mexico', 'Natasha', 'Martinax', 48, 'Russia', 'Bail', 'Goodwin', 46),
 ('Mexico', 'Rachael', 'Grate', 45, 'Russia', 'Bail', 'Goodwin', 46),
 ('Romania', 'Alexandra', 'Botez', 57, 'Russia', 'Bail', 'Goodwin', 46),
 ('Romania', 'Alina', 'Smolyar', 52, 'Russia', 'Bail', 'Goodwin', 46),
 ('Mexico', 'Natasha', 'Martinax', 48, 'Sweden', 'Emlyn', 'Erricker', 55),
 ('Mexico', 'Rachael', 'Grate', 45, 'Sweden', 'Emlyn', 'Erricker', 55),
 ('Romania', 'Alexandra', 'Botez', 57, 'Sweden', 'Emlyn', 'Erricker', 55),
 ('Romania', 'Alina', 'Smolyar', 52, 'Sweden', 'Emlyn', 'Erricker', 55),
 ('Mexico', 'Natasha', 'Martinax', 48, 'Poland', 'Barny', 'Ingerson', 57),
 ('Mexico', 'Rachael', 'Grate', 45, 'Poland', 'Barny', 'Ingerson', 57),
 ('Romania', 'Alexandra', 'Botez', 57, 'Poland', 'Barny', 'Ingerson', 57),
 ('Romania', 'Alina', 'Smolyar', 52, 'Poland', 'Barny', 'Ingerson', 57),
 ('Mexico', 'Natasha', 'Martinax', 48, 'Romania', 'Alina', 'Smolyar', 52),
 ('Mexico', 'Rachael', 'Grate', 45, 'Romania', 'Alina', 'Smolyar', 52),
 ('Romania', 'Alexandra', 'Botez', 57, 'Romania', 'Alina', 'Smolyar', 52),
 ('Romania', 'Alina', 'Smolyar', 52, 'Romania', 'Alina', 'Smolyar', 52)]

### 2. OUTER JOIN

### • Left outer join
The result of a left outer join for tables A and B always contain all the records of the `left` table (A), even if the join condition does not find any matching record in the `right` table (B).

In [5]:
%sql select * from NEW_STUDENTS left outer join SPORTS_STUDENTS on NEW_STUDENTS.test_score=SPORTS_STUDENTS.test_score

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[('Romania', 'Alexandra', 'Botez', 57, 'Poland', 'Barny', 'Ingerson', 57),
 ('Romania', 'Alina', 'Smolyar', 52, 'Romania', 'Alina', 'Smolyar', 52),
 ('Mexico', 'Natasha', 'Martinax', 48, None, None, None, None),
 ('Mexico', 'Rachael', 'Grate', 45, None, None, None, None)]

<!--  -->

### • Right outer join
Every row from the `right` table (B) will appear in the joined table atleast once. If no matching row from the `left` table (A) exists, NULL will appear in the columns from A for those records that have no match on B.

In [6]:
%sql select * from NEW_STUDENTS right outer join SPORTS_STUDENTS on NEW_STUDENTS.test_score=SPORTS_STUDENTS.test_score

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[('Romania', 'Alexandra', 'Botez', 57, 'Poland', 'Barny', 'Ingerson', 57),
 ('Romania', 'Alina', 'Smolyar', 52, 'Romania', 'Alina', 'Smolyar', 52),
 (None, None, None, None, 'Sweden', 'Emlyn', 'Erricker', 55),
 (None, None, None, None, 'Russia', 'Bail', 'Goodwin', 46)]

### • Full outer join
The full outer join combines the result of both left and right outer join and returns all rows from both the tables.

In [7]:
%sql select * from NEW_STUDENTS full outer join SPORTS_STUDENTS on NEW_STUDENTS.test_score=SPORTS_STUDENTS.test_score

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[('Romania', 'Alexandra', 'Botez', 57, 'Poland', 'Barny', 'Ingerson', 57),
 ('Romania', 'Alina', 'Smolyar', 52, 'Romania', 'Alina', 'Smolyar', 52),
 (None, None, None, None, 'Sweden', 'Emlyn', 'Erricker', 55),
 (None, None, None, None, 'Russia', 'Bail', 'Goodwin', 46),
 ('Mexico', 'Natasha', 'Martinax', 48, None, None, None, None),
 ('Mexico', 'Rachael', 'Grate', 45, None, None, None, None)]

## Thanks for reading :)
Created by [Tarun Kamboj](https://www.linkedin.com/in/kambojtarun/).